package com.demo.micro.common.domain;

/**
 * 异常编码 0成功、-1熔断、 -2 标准参数校验不通过
 * 前两位:服务标识
 * 中间两位:模块标识
 * 后两位:异常标识
 */
public enum ErrorCode {

    ////////////////////////////////////公用异常编码 //////////////////////////
    /**
     * 传入参数与接口不匹配
     */
    E_101001(101001,"传入参数与接口不匹配"),
    /**
     * 用户名为空
     */
    E_101002(101002,"用户名为空"),
    /**
     * 用户不存在
     */
    E_101003(101003,"用户不存在"),
    /**
     * 该用户名对应于多个用户，请联系管理员
     */
    E_101004(101004,"该用户名对应于多个用户，请联系管理员"),
    /**
     * 用户未绑定角色
     */
    E_101005(101005,"用户未绑定角色"),
    /**
     * 用户无任何权限
     */
    E_101006(101006,"用户无任何权限"),
    /**
     * 密码错误
     */
    E_101007(101007,"密码错误"),
    ////////////////////////////////////资源服务异常/////////////////////////////////////
    /**
     * String转换Blob失败
     */
    E_102001(102001,"String转换Blob失败"),
    /**
     * 信息不存在
     */
    E_102002(102002,"信息不存在"),
    ////////////////////////////////////特殊异常编码/////////////////////////////////////
    CUSTOM(999998,"自定义异常"),
    /**
     * 未知错误
     */
    UNKOWN(999999,"未知错误");


    private int code;
    private String desc;

    public int getCode() {
        return code;
    }

    public String getDesc() {
        return desc;
    }

    private ErrorCode(int code, String desc) {
        this.code = code;
        this.desc = desc;
    }

}
