package com.demo.microuser.domain;

/**
 * 异常编码
 * 前两位:服务标识
 * 中间两位:模块标识
 * 后两位:异常标识
 */
public enum WebErrorCode {

    ////////////////////////////////////公用异常编码 //////////////////////////
    /**
     * 传入参数与接口不匹配
     */
    E_100101(100101,"传入参数与接口不匹配"),
    /**
     * 验证码错误
     */
    E_100102(100102,"验证码错误"),
    /**
     * 验证码为空
     */
    E_100103(100103,"验证码为空"),
    /**
     * 查询结果为空
     */
    E_100104(100104,"查询结果为空"),
    ////////////////////////////////////资源服务异常编码//////////////////////////
    E_110101(110101,"用户不存在"),
    ////////////////////////////////////用户服务异常编码 //////////////////////////
    /**
     * 用户名为空
     */
    E_130101(130101,"用户名为空"),
    /**
     * 密码为空
     */
    E_130102(130102,"密码为空"),
    /**
     * 用户不存在
     */
    E_130103(130103,"用户不存在"),
    /**
     * 用户名或密码错误
     */
    E_130104(130104,"用户名或密码错误"),
    /**
     * 您不是管理员
     */
    E_130105(130105,"您不是管理员"),
    ////////////////////////////////////特殊异常编码/////////////////////////////////////
    CUSTOM(999998,"自定义异常"),
    /**
     * 未知错误
     */
    UNKOWN(999999,"未知错误");
    

    private int code;
    private String desc;
        
    public int getCode() {
        return code;
    }

    public String getDesc() {
        return desc;
    }

    private WebErrorCode(int code, String desc) {
        this.code = code;
        this.desc = desc;
    }

}
